           IDENTIFICATION DIVISION.
           PROGRAM-ID. helloworld.
           ENVIRONMENT DIVISION.
           DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 premierevariable PIC 9 VALUE ZERO.
           PROCEDURE DIVISION.
           A-PARA.
               PERFORM DISPLAY "A_PARA" END-PERFORM.
               
           B-PARA.
               DISPLAY "B_PARA".
               STOP RUN.
           C-PARA.
               DISPLAY "C_PARA".


               *> commentaire

           